distribution/examples/validation/soap-Proxy/city-soap.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cit="https://predic8.de/cities">
    <soapenv:Header/>
    <soapenv:Body>
        <cit:getCity>
            <name>Bonn</name>
        </cit:getCity>
    </soapenv:Body>
</soapenv:Envelope>