CheckMul

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Multiply>
         <tem:intA>${#TestCase#val1}</tem:intA>
         <tem:intB>${#TestCase#val2}</tem:intB>
      </tem:Multiply>
   </soapenv:Body>
</soapenv:Envelope>