API/Activities/calculator activity.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/">
   <soap:Header/>
   <soap:Body>
      <tem:Subtract>
         <tem:intA>45</tem:intA>
         <tem:intB>9</tem:intB>
      </tem:Subtract>
   </soap:Body>
</soap:Envelope>