TestSuite-Add_TestCase-Add-0-FAILED.txt

Status: FAILED
Time Taken: 18543
Size: 0
Timestamp: Fri Jul 19 17:23:07 IST 2019
TestStep: Add

----------------- Messages ------------------------------
java.net.SocketException: Connection reset

----------------- Properties ------------------------------
Endpoint: http://www.dneonline.com/calculator.asmx
Encoding: UTF-8

---------------- Request ---------------------------
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Add>
         <tem:intA>1</tem:intA>
         <tem:intB>2</tem:intB>
      </tem:Add>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
- missing response / garbage collected -
